{
  "model_type": "deepseek_v2",
  "architectures": [
    "DeepseekV2ForCausalLM"
  ],
  "eos_token_id": 23,
  "rope_scaling": {
    "type": "yarn",
    "factor": 8,
    "original_max_position_embeddings": 16,
    "mscale": 0.707,
    "mscale_all_dim": 0.707,
    "beta_fast": 32,
    "beta_slow": 1,
    "rope_theta": 10000.0,
    "rope_type": "yarn"
  },
  "vocab_size": 32,
  "hidden_size": 16,
  "intermediate_size": 32,
  "moe_intermediate_size": 16,
  "num_hidden_layers": 3,
  "num_attention_heads": 4,
  "n_routed_experts": 4,
  "n_shared_experts": 1,
  "num_experts_per_tok": 2,
  "first_k_dense_replace": 1,
  "moe_layer_freq": 1,
  "topk_method": "greedy",
  "n_group": 1,
  "topk_group": 1,
  "routed_scaling_factor": 1.0,
  "scoring_func": "softmax",
  "norm_topk_prob": false,
  "q_lora_rank": null,
  "kv_lora_rank": 8,
  "qk_rope_head_dim": 4,
  "qk_nope_head_dim": 4,
  "v_head_dim": 4,
  "max_position_embeddings": 128,
  "rope_theta": 10000.0,
  "rms_norm_eps": 1e-05,
  "attention_bias": false,
  "tie_word_embeddings": false
}