{
  "model_type": "deepseek_v2",
  "architectures": [
    "DeepseekV2ForCausalLM"
  ],
  "vocab_size": 32,
  "hidden_size": 16,
  "intermediate_size": 32,
  "moe_intermediate_size": 16,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "n_routed_experts": 4,
  "n_shared_experts": 1,
  "num_experts_per_tok": 2,
  "first_k_dense_replace": 0,
  "q_lora_rank": null,
  "kv_lora_rank": 8,
  "qk_rope_head_dim": 4,
  "qk_nope_head_dim": 4,
  "v_head_dim": 4,
  "norm_topk_prob": true,
  "routed_scaling_factor": 1.0,
  "max_position_embeddings": 64,
  "rope_theta": 10000.0,
  "rms_norm_eps": 1e-05,
  "attention_bias": false,
  "tie_word_embeddings": false,
  "eos_token_id": 9
}