{
  "model_type": "mixtral",
  "architectures": ["MixtralForCausalLM"],
  "vocab_size": 48,
  "hidden_size": 32,
  "intermediate_size": 64,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 4,
  "head_dim": 8,
  "max_position_embeddings": 64,
  "num_local_experts": 4,
  "num_experts_per_tok": 2,
  "rope_theta": 10000.0,
  "rms_norm_eps": 1e-05,
  "tie_word_embeddings": false,
  "bos_token_id": 1,
  "eos_token_id": 20,
  "_comment": "MOE-FULL-10 fixture: HF-style Mixtral config for the committed full_mixtral.safetensors weights (MOE-FULL-6). eos_token_id=20 is emitted at greedy step 1 from prompt [22,25,29] ([17,20,...]), so the controlled runtime demonstrates load -> generate -> EOS deterministically."
}
