{
  "model_type": "qwen2_moe",
  "architectures": [
    "Qwen2MoeForCausalLM"
  ],
  "vocab_size": 48,
  "hidden_size": 32,
  "intermediate_size": 32,
  "moe_intermediate_size": 16,
  "shared_expert_intermediate_size": 24,
  "num_hidden_layers": 2,
  "num_attention_heads": 4,
  "num_key_value_heads": 2,
  "num_experts": 4,
  "num_experts_per_tok": 2,
  "decoder_sparse_step": 1,
  "norm_topk_prob": false,
  "max_position_embeddings": 64,
  "rope_theta": 10000.0,
  "rms_norm_eps": 1e-05,
  "tie_word_embeddings": false,
  "eos_token_id": 31
}