{
  "metadata": {
    "total_size": 0
  },
  "weight_map": {
    "model.embed_tokens.weight": "pytorch_model-00001-of-00002.bin",
    "model.layers.0.mlp.gate_proj.weight": "pytorch_model-00001-of-00002.bin",
    "model.norm.weight": "pytorch_model-00002-of-00002.bin",
    "lm_head.weight": "pytorch_model-00002-of-00002.bin"
  }
}